@extends('layout')

@section('content')
    <div class="main_content">
        <div class="notification-container">
            <div class="notification-box">
                <h2>Сброс пароля</h2>
                <p>Мы получили запрос на сброс вашего пароля.</p>
                <p>Ссылка для сброса пароля была отправлена на вашу зарегистрированную электронную почту.</p>
                <p>Пожалуйста, проверьте свою почту, в том числе папку "Спам", если вы не видите письмо во входящих.</p>
                <p>Если вы не делали запрос на сброс пароля, проигнорируйте это сообщение. Безопасность вашего аккаунта - наша основная забота.</p>
            </div>
        </div>
    </div>







@endsection



